Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.RemoveWeld Method
 Removes a weld from the logical weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveWeld(
	BaseWeld Weld
)
Public Function RemoveWeld (
	Weld As BaseWeld
) As Boolean
Parameters
Weld
Type: Tekla.Structures.Model.BaseWeld
The weld to be removed.
Return Value
Type: Boolean
True on success.
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace